# rtdetr-ContextDRBC.yaml
# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs.
# Backbone: ConvNormLayer + BasicBlock（与 rtdetr-ContextGuideFPN / rtdetr-DRBC 相同）
# Neck: ContextGuideFusionModule (代替 Concat) + DRBC3 (代替 RepC3)

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants, i.e. 'model=rtdetr-*.yaml' will call this file with scale 'l'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]  # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]  # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]  # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                         # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]          # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]         # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]         # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]         # 7-P5/32

head:
  # ---------- 顶层 P5 主干（保持 RT-DETR 原始结构） ----------
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]            # 8  input_proj.2 (P5 -> 256)
  - [-1, 1, AIFI, [1024, 8]]                                 # 9  全局交互注意力
  - [-1, 1, Conv, [256, 1, 1]]                               # 10 Y5, lateral_convs.0

  # ---------- FPN：Y5 ↑ + P4，采用 ContextGuide + DRBC3 ----------
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]               # 11 上采样 Y5 到 P4 尺度
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]             # 12 input_proj.1 (P4 -> 256)
  - [[-2, -1], 1, ContextGuideFusionModule, []]              # 13 融合 (Y5_up + P4)
  - [-1, 3, DRBC3, [256, 0.5]]                               # 14 fpn_blocks.0 (P4 上的 DRBC3)
  - [-1, 1, Conv, [256, 1, 1]]                               # 15 Y4, lateral_convs.1

  # ---------- FPN：Y4 ↑ + P3，采用 ContextGuide + DRBC3 ----------
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]               # 16 上采样 Y4 到 P3 尺度
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]             # 17 input_proj.0 (P3 -> 256)
  - [[-2, -1], 1, ContextGuideFusionModule, []]              # 18 融合 (Y4_up + P3)
  - [-1, 3, DRBC3, [256, 0.5]]                               # 19 X3 (P3 特征, fpn_blocks.1)

  # ---------- PAN：X3 ↓ + Y4，采用 ContextGuide + DRBC3 ----------
  - [-1, 1, Conv, [256, 3, 2]]                               # 20 downsample_convs.0 (X3 -> P4 尺度)
  - [[-1, 15], 1, ContextGuideFusionModule, []]              # 21 融合 (X3_down + Y4)
  - [-1, 3, DRBC3, [256, 0.5]]                               # 22 F4 (P4 特征, pan_blocks.0)

  # ---------- PAN：F4 ↓ + Y5，采用 ContextGuide + DRBC3 ----------
  - [-1, 1, Conv, [256, 3, 2]]                               # 23 downsample_convs.1 (F4 -> P5 尺度)
  - [[-1, 10], 1, ContextGuideFusionModule, []]              # 24 融合 (F4_down + Y5)
  - [-1, 3, DRBC3, [256, 0.5]]                               # 25 F5 (P5 特征, pan_blocks.1)

  # ---------- RT-DETR 解码器 ----------
  # P3: X3(19), P4: F4(22), P5: F5(25)
  - [[19, 22, 25], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 26 Detect(P3, P4, P5)
